from django.conf import settings
from telegram.emoji import Emoji

commands = '''
help - راهنما
list - لیست عبارات شما
live - مشاهده‌ی زنده‌ی اخبار شما
stop - متوقف کردن بات
start - شروع کار با بات یا رفع توقف
'''

Description = '''
🌟خبرِمن به شما کمک میکند تا اخبار تمام خبرگزاری ها را آنطور که میخواهید مدیریت کنید.
🌟موضوعات مورد علاقه خود را بگویید تا اخبار مرتبط با آن را دریافت کنید.بین خبر ها جستجو کنید و به آنها امتیاز بدهید.
پس "start" 👇را لمس کنید تا شروع کنیم.
'''

About = '''
🌟خبرِمن به شما کمک می‌کند تا اخبار تمام خبرگزاری‌ها را آن‌طور که می‌خواهید مدیریت کنید. همین الان شروع کنید ...
'''

botpromote = ''
botpromote = Emoji.VICTORY_HAND
botpromote += 'دستیار هوشمند خبری شما   '
botpromote += settings.BOT_NAME